Public Attributes | List of all members
API_RailingRailConnectionType Struct Reference
Element Manager API
Represents a connection between two Rail/Handrail/Toprail elements. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header.
API_Guid  | owner
GUID of the Railing Node element owning this Rail Connection.
API_Guid  | symbID
The identifier of the symbol of this element.
API_RailBaseBaseConnectionID  | baseConnection
Connection type between two Rail bases: |APIBB_Horizontal|Connection type is horizontal.| |APIBB_Tangential|Connection type is tangential.|.
API_RailConnectionTypeID  | type
Connection type: |APICT_NoRailConnection|Disconnected.| |APICT_GooseneckRailConnection|Gooseneck connection.| |APICT_DirectRailConnection|Direct connection.|.
double  | railEndOffset
Offset from the end of the rail.
double  | railEndFillet
Fillet at the end of the rail.
double  | firstExtrusionLength
Length of the first extrusion.
double  | secondExtrusionLength
Length of the second extrusion.
double  | horizontalFillet
Horizontal filleting.
double  | gooseneckFillet
Gooseneck filleting.
double  | gooseneckOffset
Gooseneck offset.
double  | verticalBottomFillet
Vertical bottom filleting.
double  | directFillet
Direct filleting.
Detailed Description
Represents a connection between two Rail/Handrail/Toprail elements.
Member Data Documentation
◆ baseConnection
 API_RailingRailConnectionType::baseConnection
Connection type between two Rail bases: |APIBB_Horizontal|Connection type is horizontal.| |APIBB_Tangential|Connection type is tangential.|.
◆ directFillet
 API_RailingRailConnectionType::directFillet
Direct filleting.
◆ firstExtrusionLength
 API_RailingRailConnectionType::firstExtrusionLength
Length of the first extrusion.
◆ gooseneckFillet
 API_RailingRailConnectionType::gooseneckFillet
Gooseneck filleting.
◆ gooseneckOffset
 API_RailingRailConnectionType::gooseneckOffset
Gooseneck offset.
◆ head
 API_RailingRailConnectionType::head
General element header.
◆ horizontalFillet
 API_RailingRailConnectionType::horizontalFillet
Horizontal filleting.
◆ owner
 API_RailingRailConnectionType::owner
GUID of the Railing Node element owning this Rail Connection.
◆ railEndFillet
 API_RailingRailConnectionType::railEndFillet
Fillet at the end of the rail.
◆ railEndOffset
 API_RailingRailConnectionType::railEndOffset
Offset from the end of the rail.
◆ secondExtrusionLength
 API_RailingRailConnectionType::secondExtrusionLength
Length of the second extrusion.
◆ symbID
 API_RailingRailConnectionType::symbID
The identifier of the symbol of this element.
◆ type
 API_RailingRailConnectionType::type
Connection type: |APICT_NoRailConnection|Disconnected.| |APICT_GooseneckRailConnection|Gooseneck connection.| |APICT_DirectRailConnection|Direct connection.|.
◆ verticalBottomFillet
 API_RailingRailConnectionType::verticalBottomFillet
Vertical bottom filleting.